package SamplesAndPieces.Concurrency;

/**
 * Надо добавить в программу дверь - вход/выход в библиотеку.
 * <p>
 * В дверь может одновременно проходить 1 поток. Время прохождения через дверь потока = 0.5 секунды).
 * <p>
 * Появляются дополнительные действия со стороны поток которые они должны писать в консоль:
 * <p>
 * подошел к двери с улицы
 * <p>
 * подошел к двери изнутри
 * <p>
 * проходит через дверь внутрь
 * <p>
 * проходит через дверь наружу
 * <p>
 * прошел через дверь внутрь
 * <p>
 * прошел через дверь наружу
 */
public class LibraryWithDoor
{
}
