package JavaCore.Module01;

public class App
{
    public static void main(String[] args)
    {
        //  Как я провел лето 2017
        final String story = "В июне я ездил на выходные на Мигейские пороги Южного буга, что в Первомайске-на-буге. \n" +
                "Там очень красивый природный заповедник и, вообще, уникальное место. \n" +
                "Мы с женой покатались на нижних и верхних порогах - 'понюхали воду' :) \n" +
                "В конце июля мы провели две недели в семейном лагере у подножья Карпатской полонины в селе Лумшоры.\n" +
                "Дикий буковый лес впечатляет своими масштабами, а горы мощью и стариной. \n" +
                "Беседы на темы семьи сменялись прогулками по лесу, а вечерами были чаны - визитная карточка Карпат -,\n после которых играли в подвижные игры и мафию.\n" +
                "По дороге домой клёво провели день в Киеве - это был разгар жарких дней; пришлось спасаться в водах Днепра.\n" +
                "А в августе, воспользовавшись 'свободой', я подарил себе одиночную поездку в Славяногорский монастырь. \n" +
                "Это одно из тех мест, что называется 'must see'. Короткая, но яркая поездка с велосипедом принесла ворох впечатлений и пару открытий.\n" +
                "А осенью мы совершили поездку в Питер, где показаи нашей годовалой дочери 'high art', но это уже другая история."
                ;

        System.out.println( story );
    }
}
