package JavaCore.Module06;

/**
 * Задание 5 - HashMap
 * Написать свой класс MyHashMap как аналог классу HashMap.
 * <p>
 * Нужно делать с помощью односвязной Node.
 * <p>
 * Не может хранить две ноды с одинаковых ключами одновременно.
 * <p>
 * Методы
 * put(T key, K value) добавляет пару ключ + значение
 * <p>
 * remove(T key) удаляет пару по ключу
 * <p>
 * clear() очищает коллекцию
 * <p>
 * size() возвращает размер коллекции
 * <p>
 * get(T key) возвращает значение(K value) по ключу
 */
public class MyHashMap
{
}
