package JavaCore.Module06;

/**
 * Задание 2 - LinkedList
 * Написать свой класс MyLinkedList как аналог классу LinkedList.
 * <p>
 * Нельзя использовать массив. Каждый элемент должен быть отдельным объектом-посредником(Node - нода)
 * который хранит ссылку на прошлый и следующий элемент коллекции(двусвязный список).
 * <p>
 * Методы
 * add(T value) добавляет элемент в конец
 * <p>
 * remove(int index) удаляет элемент под индексом
 * <p>
 * clear() очищает коллекцию
 * <p>
 * size() возвращает размер коллекции
 * <p>
 * get(int index) возвращает элемент под индексом
 */
public class MyLinkedList
{
}
