package JavaCore.Module06;

/**
 * Задание 3 - Queue
 * Написать свой класс MyQueue как аналог классу Queue и LinkedList.
 * <p>
 * FIFO (first-in-first-out)
 * <p>
 * Можно делать либо с помощью Node либо с помощью массива.
 * <p>
 * Методы
 * add(T value) добавляет элемент в конец
 * <p>
 * remove(int index) удаляет элемент под индексом
 * <p>
 * clear() очищает коллекцию
 * <p>
 * size() возвращает размер коллекции
 * <p>
 * peek() возвращает первый элемент в очереди (FIFO)
 * <p>
 * poll() возвращает первый элемент в очереди и удаляет его из коллекции
 */
public class MyQueue
{
}
